const scrollSelectors = {
  section: "mentorVSreviewer",
  title: ".mentorVSreviewer__title",
  personNameSelector: ".mentorVSreviewer__quoteTitle",
  picture: ".mentorVSreviewer_picture",
  icons: ".mentorVSreviewer__iconContainer",
  mentorIcon: ".mentorVSreviewer__icon_type_mentor",
  reviewerIcon: ".mentorVSreviewer__icon_type_reviewer",
  quotesContainer: ".mentorVSreviewer__quoteContainer",
  quotesContainerLeftClass: "mentorVSreviewer__quoteContainer_type_left",
  quotesSelector: ".mentorVSreviewer__quoteText",
  mentorName: "Аня Сорокина",
  reviewerName: "Максим Гордеев",
  mentorTitleText: "Чем занимается наставник?",
  reviewerTitleText: `А какие задачи у ревьюера?`,
  mentorQuoteTexts: [
    `Я ведущий дизайнер в Сбере и наставница на направлении «Дизайн»`,
    `Два раза в месяц веду вебинары, встречаюсь с коллегами, отвечаю студентам на вопросы и даю фидбек по их проектам`,
    `В общем, делюсь опытом и мотивирую студентов, помогаю им ставить цели, рефлексировать и делать выводы`,
    `Я люблю свою работу и круто, что мне есть с кем этим поделиться ❤️`,
  ],
  reviewerQuoteTexts: [
    `Я разработчик в Яндексе и ревьюер на «Программировании»`,
    `Много проверяю работы студентов — смотрю код, простыми словами объясняю ошибки`,
    `Чаще ставлю «зачет», но если нужно, даю корректирующую обратную связь и студент улучшает проект`,
    `Чувствую, как с каждым ревью расту в аргументации решений 😎`,
  ],
  iconInactiveClass: "mentorVSreviewer__icon_style_fade",
};

export default scrollSelectors;
